ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/src/ht32f7xxxx_ckcu.c
/*********************************************************************************************************//**
 * @file    ht32f7xxxx_ckcu.c
 * @version $Rev:: 222          $
 * @date    $Date:: 2025-05-09 #$
 * @brief   This file provides all the Clock Control Unit firmware functions.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32f7xxxx_ckcu.h"

/** @addtogroup HT32F7xxxx_Peripheral_Driver HT32F7xxxx Peripheral Driver
  * @{
  */

/** @defgroup CKCU CKCU
  * @brief CKCU driver modules
  * @{
  */


/* Private constants ---------------------------------------------------------------------------------------*/
/** @defgroup CKCU_Private_Define CKCU private definitions
  * @{
  */

/* GCFGR bit field definition                                                                               */
#define CKCU_POS_CKOUTSRC       0
#define CKCU_MASK_CKOUTSRC      ((u32)0x7 << CKCU_POS_CKOUTSRC)

#define CKCU_POS_PLLSRC         8
#define CKCU_MASK_PLLSRC        ((u32)0x1 << CKCU_POS_PLLSRC)

#if (LIBCFG_CKCU_USB_PLL)
#define CKCU_POS_USBPLLSRC      9
#define CKCU_MASK_USBPLLSRC     ((u32)0x1 << CKCU_POS_USBPLLSRC)

#define CKCU_POS_USBSRC         10
#define CKCU_MASK_USBSRC        ((u32)0x1 << CKCU_POS_USBSRC)
#endif

#define CKCU_POS_CKREFPRE       11
#define CKCU_MASK_CKREFPRE      ((u32)0x1F << CKCU_POS_CKREFPRE)

/* GCCR bit field definition                                                                                */
#define CKCU_POS_SW             0
#define CKCU_MASK_SW            ((u32)0x7 << CKCU_POS_SW)

#if (LIBCFG_CKCU_USB_PLL)
#define CKCU_POS_USBPLLEN       3
#define CKCU_MASK_USBPLLEN      ((u32)0x1 << CKCU_POS_USBPLLEN)
#endif

#define CKCU_POS_PLLEN          9
#define CKCU_MASK_PLLEN         ((u32)0x1 << CKCU_POS_PLLEN)

#define CKCU_POS_HSEEN          10
#define CKCU_MASK_HSEEN         ((u32)0x1 << CKCU_POS_HSEEN)

#define CKCU_POS_HSIEN          11
#define CKCU_MASK_HSIEN         ((u32)0x1 << CKCU_POS_HSIEN)

#define CKCU_POS_CKMEN          16
#define CKCU_MASK_CKMEN         ((u32)0x1 << CKCU_POS_CKMEN)

#define CKCU_POS_PSRCEN         17
#define CKCU_MASK_PSRCEN        ((u32)0x1 << CKCU_POS_PSRCEN)

/* PLLCFGR bit field definition                                                                             */
#define CKCU_POS_POTD           21
#define CKCU_MASK_POTD          ((u32)0x3 << CKCU_POS_POTD)

#define CKCU_POS_PFBD           23
#define CKCU_MASK_PFBD          ((u32)0x1F << CKCU_POS_PFBD)

/* PLLCR bit field definition                                                                               */
#define CKCU_POS_PLLBYPASS      31
#define CKCU_MASK_PLLBYPASS     ((u32)0x1 << CKCU_POS_PLLBYPASS)

/* APBCFGR bit field definition                                                                             */
#define CKCU_POS_ADC0DIV        16
#define CKCU_MASK_ADC0DIV       ((u32)0x7 << CKCU_POS_ADC0DIV)

#if (LIBCFG_ADC1)
#define CKCU_POS_ADC1DIV        20
#define CKCU_MASK_ADC1DIV       ((u32)0x7 << CKCU_POS_ADC1DIV)
#endif

#if (LIBCFG_LCD)
#define CKCU_POS_LCDDIV         8
#define CKCU_MASK_LCDDIV        ((u32)0x7 << CKCU_POS_LCDDIV)
#endif

#if (LIBCFG_MIDI)
#define CKCU_POS_MIDIDIV        24
#define CKCU_MASK_MIDIDIV       ((u32)0x7 << CKCU_POS_MIDIDIV)
#endif

/* CKST bit field definition                                                                                */
#define CKCU_POS_PLLST          8
#define CKCU_MASK_PLLST         ((u32)0xF << CKCU_POS_PLLST)

#define CKCU_POS_HSEST          16
#define CKCU_MASK_HSEST         ((u32)0x3 << CKCU_POS_HSEST)

#define CKCU_POS_HSIST          24
#define CKCU_MASK_HSIST         ((u32)0x7 << CKCU_POS_HSIST)

#define CKCU_POS_CKSWST         0
#define CKCU_MASK_CKSWST        ((u32)0x7 << CKCU_POS_CKSWST)

/* HSICR bit field definition                                                                               */
#define CKCU_POS_TRIMEN         (0)
#define CKCU_MASK_TRIMEN        ((u32)0x1 << CKCU_POS_TRIMEN)

#define CKCU_POS_ATCEN          (1)
#define CKCU_MASK_ATCEN         ((u32)0x1 << CKCU_POS_ATCEN)

#define CKCU_POS_TMSEL          (4)
#define CKCU_MASK_TMSEL         ((u32)0x1 << CKCU_POS_TMSEL)

#define CKCU_POS_REFCLKSEL      (5)
#define CKCU_MASK_REFCLKSEL     ((u32)0x3 << CKCU_POS_REFCLKSEL)

#if (LIBCFG_CKCU_LSI_TRIM)

/* HSICR bit field definition                                                                               */
#define CKCU_POS_LSCLKSEL       (8)
#define CKCU_MASK_LSCLKSEL      ((u32)0x1 << CKCU_POS_LSCLKSEL)

/* LSITCR bit field definition                                                                              */
#define CKCU_POS_PTKEY          (16)
#define CKCU_MASK_PTKEY         ((u32)0xFFFF << CKCU_POS_PTKEY)
#define CKCU_POS_LSITRIMEN      (8)
#define CKCU_MASK_LSITRIMEN     ((u32)0x1 << CKCU_POS_LSITRIMEN)
#define CKCU_POS_LSITRIM        (0)
#define CKCU_MASK_LSITRIM       ((u32)0x7F << CKCU_POS_LSITRIM)

#define CKCU_LSITCR_KEY         (0x9B830000)

#define CKCU_HSIATCR_COUNT_PRE_REFCLK_BY_LSI                  (HSI_VALUE / 1000)

#endif

/**
  * @}
  */

/* Private macro -------------------------------------------------------------------------------------------*/
/** @defgroup CKCU_Private_Macro CKCU private macros
  * @{
  */
#define CKCU_BF_WRITE(Reg, Mask, Pos, WriteValue)   (Reg = ((Reg & ~((u32)Mask)) | ((u32)WriteValue << Pos)))
#define CKCU_BF_READ(Reg, Mask, Pos)                ((Reg & (u32)Mask) >> Pos)
/**
  * @}
  */

/* Global functions ----------------------------------------------------------------------------------------*/
/** @addtogroup CKCU_Exported_Functions CKCU exported functions
  * @{
  */
/*********************************************************************************************************//**
 * @brief Deinitialize the CKCU registers to the reset values.
 * @retval None
 ************************************************************************************************************/
void CKCU_DeInit(void)
{
  /* Reset system clock                                                                                     */
  CKCU_HSICmd(ENABLE);
  while (CKCU_GetClockReadyStatus(CKCU_FLAG_HSIRDY) == RESET);
  CKCU_SysClockConfig(CKCU_SW_HSI);

