ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/src/ht32f7xxxx_ckcu.c
  #if (LIBCFG_CKCU_USB_PLL)
  HT_CKCU->GCFGR = 0x00000302;                   /* Reset value of GCFGR                                    */
  #else
  HT_CKCU->GCFGR = 0x00000102;                   /* Reset value of GCFGR                                    */
  #endif
  HT_CKCU->GCCR = 0x00000803;                    /* Reset value of GCCR                                     */
  HT_CKCU->GCIR = 0x000000FF;                    /* Clear all interrupt flags                               */

  #if (!LIBCFG_NO_PLL)
  HT_CKCU->PLLCR = 0;                            /* Reset value of PLLCR                                    */
  #endif
  HT_CKCU->AHBCFGR = 0;                          /* Reset value of AHBCFGR                                  */
  HT_CKCU->AHBCCR = 0x00000065;                  /* Reset value of AHBCCR                                   */
  #if (!LIBCFG_NO_ADC)
  HT_CKCU->APBCFGR = 0x00010000;                 /* Reset value of APBCFGR                                  */
  #endif
  HT_CKCU->APBCCR0 = 0;                          /* Reset value of APBCCR0                                  */
  HT_CKCU->APBCCR1 = 0;                          /* Reset value of APBCCR1                                  */
  #if (!LIBCFG_CKCU_NO_APB_PRESCALER)
  HT_CKCU->APBPCSR0 = 0;                         /* Reset value of APBPCSR0                                 */
  HT_CKCU->APBPCSR1 = 0;                         /* Reset value of APBPCSR1                                 */
  #endif
  #if (!LIBCFG_CKCU_NO_AUTO_TRIM)
  HT_CKCU->HSICR = 0;                            /* Reset value of HSICR                                    */
  #endif
  #if ((!LIBCFG_CKCU_NO_APB_PRESCALER) && (LIBCFG_PWM0 || LIBCFG_PWM1 || LIBCFG_MIDI || LIBCFG_DAC0 || LIBCFG_DAC1 || LIBCFG_DACDUAL16 || LIBCFG_LCD || LIBCFG_LEDC || LIBCFG_TKEY))
  HT_CKCU->APBPCSR2 = 0;                         /* Reset value of APBPCSR2                                 */
  #endif
  #if (LIBCFG_CKCU_HSIRDYCR)
  HT_CKCU->HSIRDYCR = 0;                         /* Reset value of HSIRDYCR                                 */
  #endif
  HT_CKCU->LPCR = 0;                             /* Reset value of LPCR                                     */

  #if (LIBCFG_CKCU_LSI_TRIM)
  HT_CKCU->LSITCR  = CKCU_LSITCR_KEY;            /* Disable the LSITCR register write protection            */
  HT_CKCU->LSITCR  = 0;                          /* LSITRIMEN = 0 will reset the LSITRIM as default value,  */
                                                 /* this line also set the PTKEY = 0 to enable the write    */
                                                 /* protection function                                     */
  #endif

  HT_CKCU->MCUDBGCR = 0;                         /* Reset value of MCUDBGCR                                 */
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the external high speed oscillator (HSE).
 * @note  HSE can not be stopped if it is used by system clock or PLL.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_HSECmd(ControlStatus Cmd)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  CKCU_BF_WRITE(HT_CKCU->GCCR, CKCU_MASK_HSEEN, CKCU_POS_HSEEN, Cmd);
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the internal high speed oscillator (HSI).
 * @note  HSI can not be stopped if it is used by system clock or PLL.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_HSICmd(ControlStatus Cmd)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  CKCU_BF_WRITE(HT_CKCU->GCCR, CKCU_MASK_HSIEN, CKCU_POS_HSIEN, Cmd);
}

#if (!LIBCFG_NO_PLL)
/*********************************************************************************************************//**
 * @brief Enable or Disable the PLL clock.
 * @note  PLL can not be stopped if it is used by system clock or CK_REF.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_PLLCmd(ControlStatus Cmd)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  CKCU_BF_WRITE(HT_CKCU->GCCR, CKCU_MASK_PLLEN, CKCU_POS_PLLEN, Cmd);
}
#endif

#if (LIBCFG_CKCU_USB_PLL)
/*********************************************************************************************************//**
 * @brief Enable or Disable the USBPLL clock.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_USBPLLCmd(ControlStatus Cmd)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  CKCU_BF_WRITE(HT_CKCU->GCCR, CKCU_MASK_USBPLLEN, CKCU_POS_USBPLLEN, Cmd);
}
#endif

/*********************************************************************************************************//**
 * @brief Wait for HSE is ready to be used.
 * @retval SUCCESS or ERROR
 ************************************************************************************************************/
ErrStatus CKCU_WaitHSEReady(void)
{
  u32 ReadyCnt = 0;

  /* Wait until HSE is ready or time-out occurred                                                           */
  while (CKCU_GetClockReadyStatus(CKCU_FLAG_HSERDY) != SET)
  {
    if (++ReadyCnt >= HSE_READY_TIME)
    {
      return ERROR;
    }
  }

  return SUCCESS;
}

