ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/src/ht32f7xxxx_ckcu.c
/*********************************************************************************************************//**
 * @brief Check whether the specific clock ready flag is set or not.
 * @param CKCU_FLAG: specify the clock ready flag.
 *   This parameter can be one of the following values:
 *     @arg CKCU_FLAG_USBPLLRDY : USB PLL ready flag
 *     @arg CKCU_FLAG_PLLRDY    : PLL ready flag
 *     @arg CKCU_FLAG_HSERDY    : HSE ready flag
 *     @arg CKCU_FLAG_HSIRDY    : HSI ready flag
 *     @arg CKCU_FLAG_LSERDY    : LSE ready flag
 *     @arg CKCU_FLAG_LSIRDY    : LSI ready flag
 * @retval SET or RESET
 ************************************************************************************************************/
FlagStatus CKCU_GetClockReadyStatus(u32 CKCU_FLAG)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CKCU_FLAG(CKCU_FLAG));

  if (HT_CKCU->GCSR & CKCU_FLAG)
  {
    return SET;
  }
  else
  {
    return RESET;
  }
}

#if (!LIBCFG_NO_PLL)
/*********************************************************************************************************//**
 * @brief This function is used to configure PLL.
 * @param PLL_InitStruct: pointer to CKCU_PLLInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void CKCU_PLLInit(CKCU_PLLInitTypeDef *PLL_InitStruct)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PLL_CLKSRC(PLL_InitStruct->ClockSource));
  Assert_Param(IS_CONTROL_STATUS(PLL_InitStruct->BYPASSCmd));
  Assert_Param(IS_PLL_CFG(PLL_InitStruct->CFG));

  CKCU_BF_WRITE(HT_CKCU->GCFGR, CKCU_MASK_PLLSRC, CKCU_POS_PLLSRC, PLL_InitStruct->ClockSource);
  CKCU_BF_WRITE(HT_CKCU->PLLCR, CKCU_MASK_PLLBYPASS, CKCU_POS_PLLBYPASS, PLL_InitStruct->BYPASSCmd);
  HT_CKCU->PLLCFGR = (HT_CKCU->PLLCFGR & 0x0000FFFF) | PLL_InitStruct->CFG;
}
#endif

#if (LIBCFG_CKCU_USB_PLL)
/*********************************************************************************************************//**
 * @brief This function is used to configure USBPLL.
 * @param USBPLL_InitStruct: pointer to CKCU_PLLInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void CKCU_USBPLLInit(CKCU_PLLInitTypeDef *USBPLL_InitStruct)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_PLL_CLKSRC(USBPLL_InitStruct->ClockSource));
  Assert_Param(IS_USBPLL_CFG(USBPLL_InitStruct->CFG));

  CKCU_BF_WRITE(HT_CKCU->GCFGR, CKCU_MASK_USBPLLSRC, CKCU_POS_USBPLLSRC, USBPLL_InitStruct->ClockSource);
  HT_CKCU->PLLCFGR = (HT_CKCU->PLLCFGR & 0xFFFF0000) | USBPLL_InitStruct->CFG;
}

/*********************************************************************************************************//**
 * @brief Configure the CK_USB clock source.
 * @param USBSRC: specify the USB clock source.
 *   This parameter can be one of the following values:
 *     @arg CKCU_CKPLL    : CK_USB = CK_PLL
 *     @arg CKCU_CKUSBPLL : CK_USB = CK_USBPLL
 * @retval None
 ************************************************************************************************************/
void CKCU_USBClockConfig(CKCU_USBSRC_TypeDef USBSRC)
{
  CKCU_BF_WRITE(HT_CKCU->GCFGR, CKCU_MASK_USBSRC, CKCU_POS_USBSRC, USBSRC);
}
#endif

/*********************************************************************************************************//**
 * @brief Configure the CK_SYS source.
 * @param CLKSRC: specify the system clock source.
 *   This parameter can be one of the following values:
 *     @arg CKCU_SW_PLL : PLL is selected as CK_SYS
 *     @arg CKCU_SW_HSE : HSE is selected as CK_SYS
 *     @arg CKCU_SW_HSI : HSI is selected as CK_SYS
 *     @arg CKCU_SW_LSE : LSE is selected as CK_SYS
 *     @arg CKCU_SW_LSI : LSI is selected as CK_SYS
 * @retval None
 ************************************************************************************************************/
ErrStatus CKCU_SysClockConfig(CKCU_SW_TypeDef CLKSRC)
{
  u32 cnt = 0xFF;

  CKCU_BF_WRITE(HT_CKCU->GCCR, CKCU_MASK_SW, CKCU_POS_SW, CLKSRC);

  /* Wait until new system clock source is applied or time-out                                              */
  while (--cnt)
  {
    if (CKCU_GetSysClockSource() == (u32)CLKSRC)
    {
      return SUCCESS;
    }
  }

  return ERROR;
}

/*********************************************************************************************************//**
 * @brief Return the source clock which is used as system clock.
 * @retval The source clock used as system clock.
 *         0x01: PLL is selected as system clock
 *         0x02: HSE is selected as system clock
 *         0x03: HSI is selected as system clock
 *         0x06: LSE is selected as system clock
 *         0x07: LSI is selected as system clock
 ************************************************************************************************************/
u32 CKCU_GetSysClockSource(void)
{
  return ((u32)CKCU_BF_READ(HT_CKCU->CKST, CKCU_MASK_CKSWST, CKCU_POS_CKSWST));
}

/*********************************************************************************************************//**
 * @brief Configure the CK_AHB prescaler.
 * @param HCLKPRE: specify the value of divider.
 *   This parameter can be one of the following values:
 *     @arg CKCU_SYSCLK_DIV1  : HCLK = CK_SYS
 *     @arg CKCU_SYSCLK_DIV2  : HCLK = CK_SYS / 2
 *     @arg CKCU_SYSCLK_DIV4  : HCLK = CK_SYS / 4
 *     @arg CKCU_SYSCLK_DIV8  : HCLK = CK_SYS / 8
 *     @arg CKCU_SYSCLK_DIV16 : HCLK = CK_SYS / 16
 *     @arg CKCU_SYSCLK_DIV32 : HCLK = CK_SYS / 32
 * @retval None
 ************************************************************************************************************/
void CKCU_SetHCLKPrescaler(CKCU_SYSCLKDIV_TypeDef HCLKPRE)
{
  HT_CKCU->AHBCFGR = HCLKPRE;
}

