ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/src/ht32f7xxxx_ckcu.c
/*********************************************************************************************************//**
 * @brief Configure the CK_REF prescaler.
 * @param CKREFPRE: specify the value of divider.
 *   This parameter can be: CKCU_CKREFPRE_DIV2 to CKCU_CKREFPRE_DIV64 (CK_REF = CK_PLL / (2 * (N + 1)), N = 0 ~ 31)
 * @retval None
 ************************************************************************************************************/
void CKCU_SetCKREFPrescaler(CKCU_CKREFPRE_TypeDef CKREFPRE)
{
  CKCU_BF_WRITE(HT_CKCU->GCFGR, CKCU_MASK_CKREFPRE, CKCU_POS_CKREFPRE, CKREFPRE);
}

#if (!LIBCFG_NO_ADC)
/*********************************************************************************************************//**
 * @brief Configure the CK_ADCn prescaler.
 * @param CKCU_ADCPRE_ADCn: specify the ADCn.
 * @param CKCU_ADCPRE_DIVn: specify the prescaler value.
 *   This parameter can be one of the following values:
 *     @arg CKCU_ADCPRE_DIV1  : CK_ADC = HCLK / 1
 *     @arg CKCU_ADCPRE_DIV2  : CK_ADC = HCLK / 2
 *     @arg CKCU_ADCPRE_DIV3  : CK_ADC = HCLK / 3
 *     @arg CKCU_ADCPRE_DIV4  : CK_ADC = HCLK / 4
 *     @arg CKCU_ADCPRE_DIV8  : CK_ADC = HCLK / 8
 *     @arg CKCU_ADCPRE_DIV16 : CK_ADC = HCLK / 16
 *     @arg CKCU_ADCPRE_DIV32 : CK_ADC = HCLK / 32
 *     @arg CKCU_ADCPRE_DIV64 : CK_ADC = HCLK / 64
 * @retval None
 ************************************************************************************************************/
void CKCU_SetADCnPrescaler(CKCU_ADCPRE_ADCn_TypeDef CKCU_ADCPRE_ADCn, CKCU_ADCPRE_TypeDef CKCU_ADCPRE_DIVn)
{
  HT_CKCU->APBCFGR = (HT_CKCU->APBCFGR & (~(0x07 << CKCU_ADCPRE_ADCn))) | (CKCU_ADCPRE_DIVn << CKCU_ADCPRE_ADCn);
}
#endif

#if (LIBCFG_LCD)
/*********************************************************************************************************//**
 * @brief Configure LCD clock prescaler.
 * @param LCDCPS: Specify LCD clock prescaler.
 *   This parameter can be one of the following values:
 *     @arg CKCU_LCDPRE_DIV1  :
 *     @arg CKCU_LCDPRE_DIV2  :
 *     @arg CKCU_LCDPRE_DIV4  :
 *     @arg CKCU_LCDPRE_DIV8  :
 *     @arg CKCU_LCDPRE_DIV16 :
 * @retval None
 ************************************************************************************************************/
void CKCU_SetLCDPrescaler(CKCU_LCDPRE_TypeDef LCDPRE)
{
  CKCU_BF_WRITE(HT_CKCU->APBCFGR, CKCU_MASK_LCDDIV, CKCU_POS_LCDDIV, LCDPRE);
}
#endif

#if (LIBCFG_MIDI)
/*********************************************************************************************************//**
 * @brief Configure the CK_MIDI prescaler.
 * @param MIDIPRE: specify the value of divider.
 *   This parameter can be:
 *     @arg CKCU_MIDIPRE_DIV8  : CK_MIDI = HCLK / 8
 *     @arg CKCU_MIDIPRE_DIV9  : CK_MIDI = HCLK / 9
 *     @arg CKCU_MIDIPRE_DIV11 : CK_MIDI = HCLK / 11
 *     @arg CKCU_MIDIPRE_DIV13 : CK_MIDI = HCLK / 13
 *     @arg CKCU_MIDIPRE_DIV16 : CK_MIDI = HCLK / 16
 * @retval None
 ************************************************************************************************************/
void CKCU_SetMIDIPrescaler(CKCU_MIDIPRE_TypeDef MIDIPRE)
{
  CKCU_BF_WRITE(HT_CKCU->APBCFGR, CKCU_MASK_MIDIDIV, CKCU_POS_MIDIDIV, MIDIPRE);
}
#endif

/*********************************************************************************************************//**
 * @brief Return the frequency of the different clocks.
 * @param CKCU_Clk: pointer to CKCU_ClocksTypeDef structure to get the clocks frequency.
 * @retval None
 ************************************************************************************************************/
void CKCU_GetClocksFrequency(CKCU_ClocksTypeDef* CKCU_Clk)
{
  u32 div;
  u32 SystemCoreClockSrc = (HT_CKCU->CKST) & 7UL;
#if (!LIBCFG_NO_PLL)
  CKCU_Clk->PLL_Freq = CKCU_GetPLLFrequency();
#endif
  /* Get system frequency                                                                                   */
  switch (SystemCoreClockSrc)
  {
#if (!LIBCFG_NO_PLL)
    case CKCU_SW_PLL:
      CKCU_Clk->SYSCK_Freq = CKCU_Clk->PLL_Freq;
      break;
#endif
    case CKCU_SW_HSE:
      CKCU_Clk->SYSCK_Freq = HSE_VALUE;
      break;
    case CKCU_SW_HSI:
      CKCU_Clk->SYSCK_Freq = HSI_VALUE;
      break;
    #if (LIBCFG_LSE)
    case CKCU_SW_LSE:
      CKCU_Clk->SYSCK_Freq = LSE_VALUE;
      break;
    #endif
    case CKCU_SW_LSI:
      CKCU_Clk->SYSCK_Freq = LSI_VALUE;
      break;
    default:
      CKCU_Clk->SYSCK_Freq = 0;
      break;
  }

  /* Get HCLK frequency                                                                                     */
  div = HT_CKCU->AHBCFGR;
  CKCU_Clk->HCLK_Freq = (div >= 5) ? ((CKCU_Clk->SYSCK_Freq) >> 5) : ((CKCU_Clk->SYSCK_Freq) >> div);

  /* Get ADC frequency                                                                                      */
  #if (HT32_LIB_ENABLE_GET_CK_ADC)
  div = CKCU_BF_READ(HT_CKCU->APBCFGR, CKCU_MASK_ADC0DIV, CKCU_POS_ADC0DIV);
  CKCU_Clk->ADC0_Freq = (div == 7) ? ((CKCU_Clk->HCLK_Freq) / 3) : ((CKCU_Clk->HCLK_Freq) >> div);
  #if (LIBCFG_ADC1)
  div = CKCU_BF_READ(HT_CKCU->APBCFGR, CKCU_MASK_ADC1DIV, CKCU_POS_ADC1DIV);
  CKCU_Clk->ADC1_Freq = (div == 7) ? ((CKCU_Clk->HCLK_Freq) / 3) : ((CKCU_Clk->HCLK_Freq) >> div);
  #endif
  #endif
}

#if (!LIBCFG_NO_PLL)
/*********************************************************************************************************//**
 * @brief Return the frequency of the PLL.
 * @retval PLL Frequency
 ************************************************************************************************************/
u32 CKCU_GetPLLFrequency(void)
{
  u32 pllNO, pllNF, ClockSrc;
  u32 CKCU_BB_PLLSRC = CKCU_BF_READ(HT_CKCU->GCFGR, CKCU_MASK_PLLSRC, CKCU_POS_PLLSRC);
  u32 CKCU_BB_PLLBYPASS = CKCU_BF_READ(HT_CKCU->PLLCR, CKCU_MASK_PLLBYPASS, CKCU_POS_PLLBYPASS);
  u32 CKCU_BB_PLLEN = CKCU_BF_READ(HT_CKCU->GCCR, CKCU_MASK_PLLEN, CKCU_POS_PLLEN);
  /* Get PLL frequency                                                                                      */
  if (CKCU_BB_PLLEN == DISABLE)
  {
    return 0;
  }

  ClockSrc = (CKCU_BB_PLLSRC == CKCU_PLLSRC_HSE) ? HSE_VALUE : HSI_VALUE;

  #if (LIBCFG_CKCU_PLLSRCDIV)
  {
     u32 PllSourceClockDiv = (HT_CKCU->PLLCFGR >> 28) & 1UL;
     ClockSrc = ClockSrc >> PllSourceClockDiv;
  }
  #endif

  if (CKCU_BB_PLLBYPASS == ENABLE)
  {
    return ClockSrc;
  }

  pllNF = CKCU_BF_READ(HT_CKCU->PLLCFGR, CKCU_MASK_PFBD, CKCU_POS_PFBD);
  if (pllNF == 0)
    pllNF = 16;

