ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/src/ht32f7xxxx_ckcu.c
/*********************************************************************************************************//**
 * @brief Enable or Disable the peripheral clock.
 * @param Clock: specify the peripheral clock enable bits.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_PeripClockConfig(CKCU_PeripClockConfig_TypeDef Clock, ControlStatus Cmd)
{
  u32 uAHBCCR;
  u32 uAPBCCR0;
  u32 uAPBCCR1;

  uAHBCCR  = HT_CKCU->AHBCCR;
  uAPBCCR0 = HT_CKCU->APBCCR0;
  uAPBCCR1 = HT_CKCU->APBCCR1;

  uAHBCCR  &= ~(Clock.Reg[0]);
  uAPBCCR0 &= ~(Clock.Reg[1]);
  uAPBCCR1 &= ~(Clock.Reg[2]);

  if (Cmd != DISABLE)
  {
    uAHBCCR  |= Clock.Reg[0];
    uAPBCCR0 |= Clock.Reg[1];
    uAPBCCR1 |= Clock.Reg[2];
  }

  HT_CKCU->AHBCCR  = uAHBCCR;
  HT_CKCU->APBCCR0 = uAPBCCR0;
  HT_CKCU->APBCCR1 = uAPBCCR1;
}

/*********************************************************************************************************//**
 * @brief Configure the reference clock of HSI auto-trim function.
 * @param CLKSRC: specify the clock source.
 *   This parameter can be:
 *     @arg CKCU_ATC_LSE: LSE is selected as reference clock
 *     @arg CKCU_ATC_USB: USB is selected as reference clock
 *     @arg CKCU_ATC_CKIN: External pin (CKIN) is selected as reference clock
 * @retval None
 ************************************************************************************************************/
void CKCU_HSIAutoTrimClkConfig(CKCU_ATC_TypeDef CLKSRC)
{
  CKCU_BF_WRITE(HT_CKCU->HSICR, CKCU_MASK_REFCLKSEL, CKCU_POS_REFCLKSEL, CLKSRC);
}

/*********************************************************************************************************//**
 * @brief Initialize the ATC according to the specified parameters in the ATC_InitStruct.
 * @param ATC_InitStruct: pointer to a CKCU_ATCInitTypeDef structure.
 * @retval None
 ************************************************************************************************************/
void CKCU_ATCInit(CKCU_ATCInitTypeDef* ATC_InitStruct)
{
  HT_CKCU->HSICR &= 0xFFFFFFF3;
  HT_CKCU->HSICR |= (u32)ATC_InitStruct->SearchAlgorithm | (u32)ATC_InitStruct->FrqTolerance;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the HSI auto-trim function.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 ************************************************************************************************************/
void CKCU_HSIAutoTrimCmd(ControlStatus Cmd)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  CKCU_BF_WRITE(HT_CKCU->HSICR, CKCU_MASK_TRIMEN, CKCU_POS_TRIMEN, Cmd);
  CKCU_BF_WRITE(HT_CKCU->HSICR, CKCU_MASK_ATCEN, CKCU_POS_ATCEN, Cmd);
}

/*********************************************************************************************************//**
 * @brief Check Auto Trim is ready or not.
 * @retval TRUE or FALSE
 ************************************************************************************************************/
bool CKCU_HSIAutoTrimIsReady(void)
{
  return (HT_CKCU->HSICR & 0x80) ? TRUE : FALSE;
}

#if (LIBCFG_CKCU_LSI_TRIM)
/*********************************************************************************************************//**
 * @brief Configure the LSI Manual Trim By HSI function.
 * @retval None
 * @note  In LSI auto-trim mode, the ATC is set to manual, using the LSI as the reference clock and the HSI
          as the source. The ATC counts HSI pulses to represent the LSI period.
 ************************************************************************************************************/
void CKCU_LSIManualTrimInit(void)
{
  u32 uHSICRTemp;
  u32 uLSITCRTemp;

  /* Disable write protection. It write the PTKEY with the original field, prevent the unexpected field     */
  /* clear if the write protection is disabled before this function.                                        */
  uLSITCRTemp = HT_CKCU->LSITCR & (~(CKCU_MASK_PTKEY));  /* Read the LSITCR value except PTKEY              */
  HT_CKCU->LSITCR = CKCU_LSITCR_KEY | uLSITCRTemp;

  /* Enable LSI Trimming and write protection                                                               */
  HT_CKCU->LSITCR = CKCU_MASK_LSITRIMEN | uLSITCRTemp;

  /* Set the HSICR                                                                                          */
  /* LSCLKSEL  = 0x1 (Low Speed Clock Selection = LSI)                                                      */
  /* REFCLKSEL = 0x0 (Reference Clock Selection = low speed clock source)                                   */
  /* TMSEL     = 0x1 (Manual by user program)                                                               */
  uHSICRTemp = HT_CKCU->HSICR & (~(CKCU_MASK_REFCLKSEL));
  HT_CKCU->HSICR = uHSICRTemp | CKCU_MASK_LSCLKSEL | CKCU_MASK_TMSEL;
}

/*********************************************************************************************************//**
 * @brief Enable or Disable the LSI Manual Trim By HSI function.
 * @param Cmd: This parameter can be ENABLE or DISABLE.
 * @retval None
 * @note  In LSI auto-trim mode, the ATC is set to manual, using the LSI as the reference clock and the HSI
          as the source. The ATC counts HSI pulses to represent the LSI period.
 ************************************************************************************************************/
void CKCU_LSIManualTrimCmd(ControlStatus Cmd)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_CONTROL_STATUS(Cmd));

  /* Trimming Enable/Disable                                                                                */
  CKCU_BF_WRITE(HT_CKCU->HSICR, CKCU_MASK_TRIMEN, CKCU_POS_TRIMEN, Cmd);
}

/*********************************************************************************************************//**
 * @brief Do the LSI Manual Trim by HSI function and check it is ready or not.
 * @param ErrorCount: The target error count (accuracy = ErrorCount/8000).
 *   This parameter can be set manual or be one of the following define:
 *     @arg   CKCU_LSITRIM_ACCURACY_0P0 : Margin of error +-0.0%
 *     @arg   CKCU_LSITRIM_ACCURACY_0P5 : Margin of error +-0.5%
 *     @arg   CKCU_LSITRIM_ACCURACY_1P0 : Margin of error +-1.0%
 *     @arg   CKCU_LSITRIM_ACCURACY_1P5 : Margin of error +-1.5%
 *     @arg   CKCU_LSITRIM_ACCURACY_2P0 : Margin of error +-2.0%
 * @retval TRUE or FALSE
 * @note  The HSIATCR is updated every 2 ms. It is recommended to use a timer to call the
 *        "CKCU_LSIManualTrimIsReady()" >= 2 ms.
 ************************************************************************************************************/
bool CKCU_LSIManualTrimIsReady(u32 ErrorCount)
{
  u32 atCntrMax;
  u32 atCntrMin;
  bool isReady = TRUE;

  /* Get HSI Auto trimming counter.                                                                         */
  u32 cntr = HT_CKCU->HSIATCR;

  /* Get LSI manual trimming counter.                                                                       */
  u32 LSICurrentTrimValue =  HT_CKCU->LSITCR & CKCU_MASK_LSITRIM;

