ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/src/ht32f7xxxx_ckcu.c
  if (cntr == 0)
  {
    return FALSE;
  }

  /* Calculate the range of margin of error for LSI trimming counter.                                       */
  atCntrMax = CKCU_HSIATCR_COUNT_PRE_REFCLK_BY_LSI + ErrorCount;
  atCntrMin = CKCU_HSIATCR_COUNT_PRE_REFCLK_BY_LSI - ErrorCount;

  /* Modify LSI trim value                                                                                  */
  if (cntr < atCntrMin)
  {
    LSICurrentTrimValue++;   /* trimming counter + 1 = slower freq                                          */
    isReady = FALSE;
  }
  else if (cntr > atCntrMax)
  {
    LSICurrentTrimValue--;   /* trimming counter - 1 = faster freq                                          */
    isReady = FALSE;
  }

  if ((isReady == FALSE) && (LSICurrentTrimValue <= CKCU_MASK_LSITRIM))
  {
    /* Disable write protection                                                                             */
    HT_CKCU->LSITCR = CKCU_LSITCR_KEY | (HT_CKCU->LSITCR & (~(CKCU_MASK_PTKEY)));

    /* Set the LSI new trimming value                                                                       */
    HT_CKCU->LSITCR = CKCU_MASK_LSITRIMEN | LSICurrentTrimValue;
  }

  return isReady;
}
#endif

#if (LIBCFG_CKCU_HSIRDYCR)
/*********************************************************************************************************//**
 * @brief Set HSI Ready Counter Value.
 * @param Value: 0x0~0x1F.
 * @retval None
 ************************************************************************************************************/
void CKCU_SetHSIReadyCounter(u8 Value)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_COUNTER_VALUE(Value));

  HT_CKCU->HSIRDYCR = ((HT_CKCU->HSIRDYCR) & (~(0x1F))) | Value;
}
#endif

/*********************************************************************************************************//**
 * @brief Set HSE Gain Mode.
 * @param GanMode: Specify the gain mode of HSE.
 *   This parameter can be:
 *     @arg CKCU_HSE_LOW_GAIN_MODE         : HSE low gain mode
 *     @arg CKCU_HSE_HIGH_GAIN_MODE        : HSE high gain mode
 * @retval None
 ************************************************************************************************************/
void CKCU_SetHSEGainMode(u32 GanMode)
{
  /* Check the parameters                                                                                   */
  Assert_Param(IS_GAINMODE(GanMode));

  HT_CKCU->GCCR = (HT_CKCU->GCCR & ~(0x100)) | GanMode;
}

/**
  * @}
  */


/**
  * @}
  */

/**
  * @}
  */
